#include<reg52.h>
#include"uart.h"

//-----------------0-9,A-F ASCII编码----------------------------
unsigned char code NUM_STR[16] =
{
	0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,
 	0x38,0x39,0x41,0x42,0x43,0x44,0x45,0x46
};
//--------------------------------------------------------------

//****************************串口初始化**********************************
// 入口参数：	无
// 出口参数：	无
// 函数功能：	初始化串口
// 使用方法：  需要使用串口时首先调用此函数
//************************************************************************
void UART_init(void)
{
	TMOD = 0x20;	   		// T1定时方式2(8位自动重装)

//--------------设定波特率------------------------
//======================9600bps=================================
//	TH1 = 0xfd;					// 波特率9600 11.0592M
//	TL1 = 0xfd;					// 256-11059200/12/32/9600 = 253(0xfd)
//	SCON = 0x50;      		// 串口方式1   9600bps时使用

//=======================4800bps================================
	TL1 = 0xfa;                  //11.0592M晶振波特率为4800bps
    TH1 = 0xfa;
	SCON = 0x50; //4

//------------------------------------------------
	TR1 = 1;          		// 启动T1
	ES  = 1;				// 允许串口中断

}	 

//****************************串口发送字符串******************************
// 入口参数：	*str:字符串首地址
//					ENTER:(回车换行) 0：不换行  1：换行 
// 出口参数：	无
// 函数功能：	从串口发送一字符串
//************************************************************************
void UART_TXDSTRING( char *str, unsigned char ENTER)
{
	while( *str )						// 输出字符直到字符串结束
	{
		SBUF = *str;					// 发送当前字符
		while( TI==0 ); TI = 0;		// 等待发送完成
		str++;							// 指针加1，下一字符
	}
//---------------------------------------------------------
	if( ENTER!=0 )						// 是否需要输出换行
	{
		SBUF = 0x0d;					// 回车ASCII码
		while( TI==0 ); TI = 0;		// 等待发送完成
		SBUF=0x0a;						// 换行ASCII码
		while( TI==0 ); TI = 0;		// 等待发送完成
	}
}
//**************************发送数字**************************************
// 入口参数：	NUM:待发送数字（范围：0-255）
//					ENTER:(回车换行) 0：不换行  1：换行 
// 出口参数：	无
// 函数功能：	从串口发送一数字
//************************************************************************
/*void UART_TXDNUMBER(unsigned char NUM,
                    unsigned char ENTER)
{
	unsigned char NUM_D[3];
	ES = 0;							// 禁止串口中断
	NUM_D[0] = NUM/100;			// 百位
	NUM_D[1] = NUM%100/10;		// 十位
	NUM_D[2] = NUM%10;			// 个位
//-----------------------------------------------------
	SBUF = NUM_STR[NUM_D[0]];	// 装入百位数据
	while( TI==0 ); TI = 0;		// 等待发送完成
	SBUF = NUM_STR[NUM_D[1]];	// 装入十位数据
	while( TI==0 ); TI = 0;		// 等待发送完成
	SBUF = NUM_STR[NUM_D[2]];	// 装入个位数据
	while( TI==0 ); TI = 0;		// 等待发送完成
//-----------------------------------------------------
	if( ENTER != 0 )	   		// 是否需要回车换行
	{
		SBUF = 0x0d;				// 回车ASCII码
		while( TI==0 ); TI = 0;	// 等待发送完成
		SBUF=0x0a;					// 换行ASCII码
		while( TI==0 ); TI = 0;	// 等待发送完成
	}
	ES = 1;							// 打开串口中断
}	*/